# Напишите программу, которая посчитает сколько букв «b» в введенной
# строке текста.

t = input('Enter text: ')
t = t.count('b')
print(t)